{"meta":{"title":"Harold Talks Tech","subtitle":"Nói gì cho ngầu","description":"Harold Talks Tech ra đời với một mục tiêu duy nhất, đó là giúp bạn hiểu thêm về đời sống công nghệ đang diễn ra hàng ngày, hàng giờ xung quanh chúng ta.","author":"Harold Hoang","url":"http://haroldh2003.github.io","root":"/"},"pages":[{"title":"Về tôi","date":"2019-03-21T07:50:25.000Z","updated":"2019-03-25T06:45:37.586Z","comments":true,"path":"about/index.html","permalink":"http://haroldh2003.github.io/about/index.html","excerpt":"","text":""},{"title":"Tags","date":"2019-03-21T07:49:55.000Z","updated":"2019-03-25T06:46:01.150Z","comments":true,"path":"tags/index.html","permalink":"http://haroldh2003.github.io/tags/index.html","excerpt":"","text":""},{"title":"Chuyên mục","date":"2019-03-21T07:49:04.000Z","updated":"2019-03-25T06:45:18.682Z","comments":true,"path":"categories/index.html","permalink":"http://haroldh2003.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Màn hình gập - Công nghệ của tương lai?","slug":"Foldables","date":"2019-03-21T07:52:25.801Z","updated":"2019-03-27T06:03:38.631Z","comments":true,"path":"2019/03/21/Foldables/","link":"","permalink":"http://haroldh2003.github.io/2019/03/21/Foldables/","excerpt":"","text":"Con người chúng ta thường có những ham muốn không bao giờ kết cho những thay đổi. Thật vậy, chúng ta sợ phải đối mặt với sự nhàm chán. Như bản thân mình, mình sợ vãi “mật” khi biết rằng phải đối mặt với một công việc nào đó lặp đi lặp lại mà không thấy ngày mai. Thế nên khi mà trên các phương tiện truyền thông đưa tin về một “gimmick” (trong tiếng Anh nghĩa là ‘some thing that is not serious or real value that is used to attract people’s attention or interest temporarily, especially to make them buy something’, trong tiếng mẹ đẻ của chúng ta là một dạng thông tin quảng cáo làm quá, nâng “bi” về tính năng đột phá nào đó của công nghệ này để người ta lao vào mua xong rồi nhận ra cái đó chả có lợi ích gì cho lắm) như tính năng quét hình ảnh, chụp ảnh 3D, “tai thỏ”, hay tính năng thay đổi cuộc chơi như “chạm đa điểm”, thời khắc mà ta được tận tay trải nghiệm những thứ trên thì đầu ta đã nghĩ đến những thay đổi tiếp theo rồi. Không cần quan tâm tính năng đó có thật hay không, hay có thật sự khả thi hay không, hay chỉ đơn giản là nó có hữu dụng với thói quen sử dụng hàng ngày của ta hay không, nhưng có một thứ chắc chắn có ý nghĩa đó là tính năng đó “mới”, “khác biệt” và chắc hẳn là rất hào hứng để được trải nghiệm. Đó chính là thứ mà mình đang muốn nhắc đến trong bài viết này, vâng chính là công nghệ “màn hình gập”, không chỉ đơn thuần là điện thoại màn hình gập thôi đâu. Dạo gần đây sau sự kiện Mobile World Congress (MWC) 2019, trên các diễn đàn công nghệ, các Youtube vloggers hay nhắc đến cụm từ “foldables” hay “foldable phones”, mình sẽ bàn về chủ đề này trong Harold Talks Tech số đầu tiên nhé. Apple và điện thoại màn hình gậpNhiều năm về trước, lâu hơn mọi người có thể nghĩ đến, mình nghe nói rằng Apple đã từng thử nghiệm với điện thoại gập (mình không chắc là điện thoại màn hình gập hay đơn giản là gập kiểu màn hình và bàn phím là 2 mảnh rời rồi ráp lại như kiểu Nokia Communicator E90 thời cấp 3 mình có thấy phụ huynh của một bạn trong lớp mình dùng – thời đó phải đại gia mới có mà dùng (hình như 800 Mỹ Kim thời 2007). Nghĩ đi nghĩ lại thì mình thấy điều này đúng là có ý nghĩa gì đó. Chắc chắn là Steve đã từng thử nghiệm với những cỡ điện thoại có màn hình lớn hơn cả iPhone 4 rồi, rất lâu trước cả thời điểm họ xuất xưởng iPhone 6. Và những thử nghiệm này thường phải mất rất lâu trước khi nó được trình làng trở thành phiên bản thương mại khi mà Apple thực sự hài lòng với nó. Tương tự như cách mà Apple giới thiệu màn hình OLED trên iPhone X cách đây gần 2 năm. Mình tưởng tượng rằng Apple đã thử nghiệm với các thiết bị gập, đóng và mở để bật tắt màn hình bên trong chẳng hạn, trong một thời gian dài. Có thể dài hơn mình nghĩ nữa chăng ? Không riêng gì Apple, các nhà sản xuất đều cố gắng tìm ra thứ gì đó không chỉ khác biệt mà còn tốt hơn đáng kể so với những gì chính họ có thể làm không kể việc màn hình có gập được hay không. Câu chuyện quá khứNếu các bạn có máy du hành thời gian của Doraemon, quay lại một thời gian rất lâu về trước, ý tưởng gập không mới với nhân loại. Con người đã gập rất nhiều thứ trước cả khi…có thứ để chúng ta gập được. Sách là ví dụ kinh điển nhất. Nhưng mọi thứ không dừng lại ở đó. Chúng ta đã gập ví và cả tiền bên trong ví. iPhone 6 lúc mới ra đời cũng đã gập được trong túi quần mỗi khi ta ngồi xuống (ahihi), quần áo và cả thức ăn của chúng ta đều được gập và cuộn từ rất lâu, tụ chung lại là nhân loại đã gập được mọi thứ trước khi cả chúng có thể được gập. Với thiết bị điện tử, chúng ta đã gập đôi máy tính cá nhân trong một nửa thập kỷ – thứ mà ta vẫn quen thuộc nhắc đến tên nó với tên gọi laptop hay máy tính xách tay (MTXT) Với trò chơi điện tử hay video games thời mình còn học cấp 2 đã có mặt thiết bị trở thành niềm ao ước của biết bao đứa trẻ mê game – Gameboy Advanced , và hơn cả là những chiếc điện thoại gập đã đi cùng với những ngày đầu của điện thoại di động cầm tay – Oh yeah, cụm từ thân thương “Hello Moto”mà thế hệ cuối 8x, đầu 9x đều nhớ khi mở nắp gập chiếc Motorola Razr v3i.","categories":[{"name":"Di động","slug":"Di-dong","permalink":"http://haroldh2003.github.io/categories/Di-dong/"}],"tags":[{"name":"màn hình gập","slug":"man-hinh-gap","permalink":"http://haroldh2003.github.io/tags/man-hinh-gap/"},{"name":"smartphones","slug":"smartphones","permalink":"http://haroldh2003.github.io/tags/smartphones/"},{"name":"tương lai","slug":"tuong-lai","permalink":"http://haroldh2003.github.io/tags/tuong-lai/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-03-21T07:32:31.121Z","updated":"2019-03-27T06:03:17.191Z","comments":true,"path":"2019/03/21/hello-world/","link":"","permalink":"http://haroldh2003.github.io/2019/03/21/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"Markdown","slug":"Markdown","permalink":"http://haroldh2003.github.io/categories/Markdown/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://haroldh2003.github.io/tags/Hexo/"},{"name":"Tutorial","slug":"Tutorial","permalink":"http://haroldh2003.github.io/tags/Tutorial/"}]}]}